9/data/attachments/861a3ae016912e46.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Nicholas_population_Friend_73807_8</nif:username>
            <nif:friendToBeRequested>soap_friends_023a720d-da53-4df2-83d6-81a01cdc8840</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>